system/fvSolution_bkup
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
}

PISO
{
    nCorrectors     10;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


relaxationFactors
{
   fields
   {
          p      0.95;
   }


    equations
    {
        U               0.05; // 0.9 is more stable but 0.95 more convergent
        k               0.6;
  //       epsilon         0.5;
  //       omega           0.5;
  //       R               0.5;
        ".*"            0.9; // 0.9 is more stable but 0.95 more convergent
    }


}



// ************************************************************************* //
